// Всі логічні повертають true або false

//АБО - ||

// Я піду гуляти якщо буде гарна погода АБО в мене буде парасолька.

//буде гарна погода?  або  В мене буде парасолька.

// true || false // true - означає ми ідем гулять
// false || true // true - ми ідем гулять
// true || true // true - ми ідем гулять
// false || false // false - Ми не ідем гулять, ідем допомагать мити посуд

// Якщо хочаб одне значення true ми отримуєм true з усього порівняння

// && - І

// Щоб вивчити JS мені необхідно виконувати домашні завдання І бути присутнім на уроках

// мені необхідно виконувати домашні завдання І бути присутнім на уроках

//true - false //  false - Ми не вивчили
//false - true // false - ми не вивчили
// false - false // false - ми не вичили
// true - true // true - Навчання (Ми вивчили)

// Якщо у вашому виразі є хоча б одне FALSE ви отримаєте негативний результат

// ! - НЕ
// (! - дозволяє обернути значення на протилежні)

console.log(!true);

// ЛІниві ОПРЕРАТОРИ
