// створити декілька об'єктів гравців і написати функцію для порівняння двох гравців за допомогою посилань (reference types).

// Умови:

// Створи двох гравців з різними характеристиками (наприклад, ім'я, рівень, кількість очок).
// Створи ще одного гравця, який буде точною копією одного з уже створених гравців.
// Напиши функцію, яка порівнюватиме гравців за допомогою посилань (тобто, функція повинна повертати true, якщо порівнюються саме ті ж самі об'єкти в пам'яті, і false, якщо це просто об'єкти з однаковими значеннями).
// Для прикладу, виклич функцію порівняння для:
// Двох різних гравців.
// Гравця та його копії.
// Двох однакових об'єктів (які посилаються на одне й те ж місце в пам'яті).
