// 1)Створити масив із 5-ти рядків. Вивести на екран кожен рядок з масиву, який містить більше 5-ти символів.

const strings = ["Hello", "world", "Мене", "звуть", "Артем"];

console.log(strings.join(" "));

// for - ключове слово
// let i = 0; - лічильник;
// i < strings.length - умова за якої масив припинить виконання
// i++ - що буде відбуватись з лічильником після кожного виконання тіла циклу(ітерація)
//{ } - тіло циклу
for (let i = 0; i < strings.length; i++) {
  const element = strings[i];
  if (element.length < 5) {
    continue;
  }
  console.log(element);
}

// Якщо ви бачите перед собою масив варто його перебрати

// 2)Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву.
// 3)Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран.

const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

for (let i = 0; i < numbers.length; i++) {
  const element = numbers[i];
  // % - рахує остачу від ділення
  if (element % 2 === 0) {
    console.log(element);
  }
  // Зробити так,щоб виводилась 1
  //   if (element % 3 === 0) {
  //     console.log(element);
  //   }
}
