// 1. Створити змінні для зберігання температури за Цельсієм та
// Фаренгейтом. Перевести температуру з Цельсія у
// Фаренгейти за допомогою формули та вивести результат в
// консоль.
// 2. Створити змінну для зберігання кількості днів у місяці.
// Обчислити кількість годин та хвилин у цьому місяці за
// допомогою оператора множення та вивести результат в
// консоль.
// 3. Створити змінні для зберігання рівня здоровʼя та енергії
// гравця в грі. Зменшити рівень здоровʼя та енергії гравця за
// допомогою операторів віднімання та вивести результат в
// консоль.
// 4. Створити змінну для зберігання суми покупки в магазині.
// Застосувати знижку в розмірі 10% до цієї суми за
// допомогою оператора множення та вивести результат в
// консоль.
// 5. Створити змінну для зберігання числа з плаваючою комою.
// Використати метод Math.floor() для округлення числа до
// меншого та вивести результат в консоль.
// 6. Створити змінну для зберігання рядка, який містить числа з
// плаваючою комою. Використати метод parseFloat() для
// перетворення рядка у десяткове число та вивести
// результат в консоль.
// 7. Створити змінну для зберігання рядка, який містить ціле
// число. Використати метод parselnt для перетворення
// рядка у ціле число та вивести результат в консоль.
// 8. Створити змінну для зберігання числа. Використати метод
// Math.sqrt() для обчислення квадратного кореня числа та
// вивести результат в консоль.
// 9. Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати метод
// parselnt() для перетворення рядка у ціле число та вивести
// результат в консоль. Потім використати метод toString() для
// перетворення цілочисельного значення у рядок та вивести
// результат в консоль.

// ---------------------------------

const myNull = null;

const num = 23;

console.log(num.toString()); // приведення числа до строки.
