// 1)Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції.
//  - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
//  - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
//             - 'Посилка буде відправлена сьогодні'
//     - 'Вам передзвонит менеджер'.

// 2)Напиши скрипт вибору готеля по кількості зірок.
// 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
//  Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
//  'Токої кількості зірок немає'

// 3)Створити розмітку з формою, що містить список(select) з трьома варіантами вибору: "Кава", "Чай" та "Сік".При виборі кожного варіанту виводити відповідне повідомлення в блок на сторінці.

// 4)Створити розмітку  з полем введення, що приймає рядок та кнопкою.При натисканні на кнопку перевіряти, чи введений рядок є днем тижня(наприклад: "понеділок", "вівторок" і т.д.), виводити відповідне повідомлення про робочий день або вихідний.

// 5)Створити розмітку  з полем введення, що приймає номер місяця та кнопкою.При натисканні на кнопку виводити повідомлення про пору року, до якої належить цей місяць.

// 6)Створити розмітку  з полем введення, що приймає номер місяця та кнопкою.При натисканні на кнопку виводити кількість днів у цьому місяці.

// 7)Створити розмітку  з полем введення, що приймає назву кольору(наприклад, "червоний", "синій" і т.д.) та кнопкою.При натисканні на кнопку виводити відповідне повідомлення про дію: якщо це "червоний" - "стоп", якщо "зелений" - "йти", якщо "жовтий" - "чекати".

// 8)Створити розмітку  з двома полями введення, що приймають числа та список (select) з варіантами вибору операцій: "+", "-", "*", "/". При натисканні на кнопку виводити результат обраної операції над цими числами. Користувач повинен бути попереджений про можливість ділення на нуль.
