// 7. Створити скрипт який виводить спливаюче вікно з запитом на введення імені
// користувача за допомогою prompt(). Після введення імені вивести повідомлення
// привітання з використанням введеного імені.

// 9. Створити скрипт який виводить спливаюче попередження за допомогою alert().
// Вивести повідомлення про те, що дія небезпечна та попросити користувача
// підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію,
// вивести повідомлення "Дякую за підтвердження!". Якщо користувач
// відмовляється, вивести повідомлення "Дію відмінено!".

// Створюємо в памʼяті незмінне значення під назвою name  та в неї присвоюємо значення виклику методу промпт

// Застосували prompt для того щоб отримати імʼя
// далі оскільки попросили щось зробити ще з введеними даними нам довелось їх зберегти у змінну
// const name = prompt("Введіть імʼя");

// Вивели привітання за допомогою методів взаємодії з користувачем
// Дозволяє вивести щось у консоль браузера
// alert("Привіт " + name);
// console.log(" Привіт " + name);

// 8. Створити скрипт який виводить спливаюче підтвердження за допомогою
// confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за
// підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію
// відмінено!".

// const isOk = confirm("Чи ви підтверджуєте дію?");

// console.log("isOk :>> ", isOk);

// if (isOk) {
//   console.log("Все ок");
// } else {
//   console.log("Все не ок");
// }

// 9. Створити скрипт який виводить спливаюче попередження за допомогою alert().
// Вивести повідомлення про те, що дія небезпечна та попросити користувача
// підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію,
// вивести повідомлення "Дякую за підтвердження!". Якщо користувач
// відмовляється, вивести повідомлення "Дію відмінено!".

alert("Дія небезпечна");

const answer = confirm("Чи бажаєте ви продовжити?");

if (answer === true) {
  console.log("Дякую за підтвердження!");
} else {
  console.log("Дію відмінено!");
}
