"use strict";

//Виводить дані на вкладочку "Консоль" у панелі розробника

// змінна - це комірка в памʼяті нашого ПК куди ми записуємо ,будь які, дані які нам потрібні.
// b - змінна в яку ми поклали 10

//КОД ВИ ПИШИТЕ ДЛЯ ЛЮДЕЙ НЕ ДЛЯ КОМПУХТЕРА

// b - назва змінної
//  = - оператор присвоєння
// 10 - дані які ми бажаємо присвоїти у комірку(зміну b)
b = 10;
x = b + 2;
console.log(x);

// 0101010101010010101001000101001010101010101001010101
name = "Artem";
console.log(name);
// ВЛАСТИВІСТЬ - якась описова характеристика
// name.length - через крапку ми з вами звертаємось до властивостей елементу
// name - імʼя .length - довжина імені в символах
nameLength = name.length;
console.log(nameLength);

// МЕТОД - дозволяє зробити дію

// методи ми також пишемо через крапку перед назвою методу та з дужками крушлими у кінці

console.log(name.toUpperCase());

//
