// function - ключове слово яке повідомляє всьому що читає цей код,що ви ствоюєте функцію
// getSum - назва вашої функції за якою в майбутньому ви будете її викликати
// () - параметри функції це те що ми записуєм у круглі дужки коли створюємо нашу функцію(a,b - параметри яка наша функція має отримати ззовні -  це можуть бути текстові інпути, це будуть параметри які передаються при виклиці функції)
// {} - тіло функції
//   console.log(5 + 5); - завдання нашої функції
function getSum(a, b) {
  console.log(a);
  console.log(b);
  console.log(a + b);
}

// getSum - імʼя нашої функції яку ми хочемо використати;
// для того щоб запустити функцію(дію) ми маємо після імені функції записати круглі дужечки()
//(3, 4) - при виклиці в круглих дужках ми можемо з вами записати аргументи для запуску функції
getSum(3, 4);
