// щоб створити масив (список) даних то ви маєте записати квадратні дужки[]а вже в них через кому перелічувати,що ви хочете тут зберігати

// список продуктів які попросили придбати додому
// Зазвичай в масивах зберігаються однотипні дані

// масив [](список) = <ul>(список)

// щоб створити список в JS ми маємо створити масив[]
const products = ["potato", "onion", "cheaps"];

// Нам треба картоплю вихреслити з списку
// дізнатись індекс необхідного елементу(індекси розраховуються з 0)
//після назви масиву одразу прописати квадратні дужки []
// у квадратних дужках вписати індекс елементу з яким ми бажаємо працювати
console.log(products[0]);

const random = ["fixme", 400, "сторінку не знайдено", null, undefined, true];

console.log(random);

// Масиви(списки) - зазвичай містять у собі один тип даних

const numbers = [1, 2, 3, 4];

// отримання доступу до елементу масиву

// 1)назва масиву з яким ми хочемо взаємодіяти це numbers
//2) після назви необхідно записати квадратні дужки
// 3)необхідний індекс = 2

console.log("ДО");
console.log(numbers[2]);

// щоб замінити значення маєте записати нове значення після =
//  = оператор присвоєння
numbers[2] = 5;
console.log("Після");
console.log(numbers[2]);
