// 1.Написати скрипт відкриття та закриття модального вікна по кнопці.

// 2.Використовуючи попередній код написати скрипт закриття модального вікна по кліку на бекдроп

// 3.Напиши скрипт в якому є три радіобатони зі значенями кольрів. При обиранніна будь якого колір фону боді змінюється відповідно

// 4. Напиши скрипт який, при наборі тексту в інпут input#name-input (подія input), підставляє його поточне значення в span#name-output. якщо інпут порожній, в спані повинен відображатися рядок 'незнайомець'.
